Revit 2024 API
GBXMLExportOptions Members
The GBXMLExportOptions type exposes the following members.
Constructors
Name | Description
GBXMLExportOptions
 Constructs a new instance of the options used to export a model in gbXML (green-building) format.
Methods
Name | Description
Dispose
Releases all resources used by the GBXMLExportOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Encoding
 The encoding options to go into the processing instruction for the exported gbXML file.
ExportAnalyticalSystems
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
ExportEnergyModelType
 The energy model type from which gbXML will be exported.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace